%----------Matlab Code by L. Kort (Aug. 27, 2019)--------------------------
%----------Universal Constrains File---------------------------------------
%----------Insira a função de restrição abaixo-----------------------------
function [y] = UCF(x)
global noc count
%----------Exempo----------------------------------------------------------
% y(1) = t-t_max;
% y(2) = s-s_max;
% y(3) = x(1)-x(4);
% y(4) = 0.10471*x(1)^2+0.04811*x(3)*x(4)*(14.0+x(2))-5.0;
% y(5) = d-d_max;
% y(6) = P-P_c;
%----------Insira as função de restrição-----------------------------------
y(1)=0;



%--------------------------------------------------------------------------
    noc=size(y,2);
    count=0;
    for w=1:noc
        if y(w)<= 0
            count=count+1;
        end
    end
end